DataProcessors/ВыгрузкаДанныхВоФронтол.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаДанныхВоФронтол</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>РабочиеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выгружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СПользователями</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ТипыРозничныхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыРозничныхТочек</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Избенка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магазин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перекресток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Микромаркет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятерочка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПространствоВкуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вкусомат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тилси</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркетПлейс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПространствоВкусвилл</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/РабочиеМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>РабочиеМеста</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CashName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IPАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРабочейСтанции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогБД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВыгрузкиВоФронтол</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФронтол</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФронтол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможнаВидеозапись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПривязыватьТерминалыАвтоматомПоЧекам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ВыгрузкаДанныхВоФронтол/Forms/Форма/Ext/Form/Module.bsl
Процедура ВыгрузитьСервер()

	ТабКВыгрузке = Новый ТаблицаЗначений;
	ТабКВыгрузке.Колонки.Добавить("РабочееМесто");
	ТабКВыгрузке.Колонки.Добавить("СПользователями");
	
	Для Каждого СтрокаТаб Из Объект.РабочиеМеста Цикл
		Если НЕ СтрокаТаб.Выгружать Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТаб.РабочееМесто.КаталогВыгрузкиВоФронтол) Тогда
			Сообщить("У рабочего места " + СтрокаТаб.РабочееМесто + " не заполнен каталог выгрузки во фронтол");
			Продолжить;
		КонецЕсли;
		СтрокаДоб = ТабКВыгрузке.Добавить();
		СтрокаДоб.РабочееМесто 		= СтрокаТаб.РабочееМесто;
		СтрокаДоб.СПользователями 	= СтрокаТаб.СПользователями;
	КонецЦикла;
	
	Обработки.ВыгрузкаДанныхВоФронтол.ВыгрузитьДанныеВоФронтол(ТабКВыгрузке);	
	
КонецПроцедуры

Процедура ВыгрузитьСервер_СтараяСхема()

	ТабКВыгрузке = Новый ТаблицаЗначений;
	ТабКВыгрузке.Колонки.Добавить("РабочееМесто");
	ТабКВыгрузке.Колонки.Добавить("СПользователями");
	
	Для Каждого СтрокаТаб Из Объект.РабочиеМеста Цикл
		Если НЕ СтрокаТаб.Выгружать Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТаб.РабочееМесто.КаталогВыгрузкиВоФронтол) Тогда
			Сообщить("У рабочего места " + СтрокаТаб.РабочееМесто + " не заполнен каталог выгрузки во фронтол");
			Продолжить;
		КонецЕсли;
		СтрокаДоб = ТабКВыгрузке.Добавить();
		СтрокаДоб.РабочееМесто 		= СтрокаТаб.РабочееМесто;
		СтрокаДоб.СПользователями 	= СтрокаТаб.СПользователями;
	КонецЦикла;
	
	Обработки.ВыгрузкаДанныхВоФронтол.ВыгрузитьДанныеВоФронтол_(ТабКВыгрузке);	
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ВыгрузитьСервер();	
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьФлажкиДляСтроки(Команда)
	
	Для Каждого СтрокаТаб Из Объект.РабочиеМеста Цикл
		СтрокаТаб.Выгружать = Истина;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиДляСтроки(Команда)
	
	Для Каждого СтрокаТаб Из Объект.РабочиеМеста Цикл
		СтрокаТаб.Выгружать = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоПользователям(Команда)
	
	Для Каждого СтрокаТаб Из Объект.РабочиеМеста Цикл
		СтрокаТаб.СПользователями = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПоПользователям(Команда)
	
	Для Каждого СтрокаТаб Из Объект.РабочиеМеста Цикл
		СтрокаТаб.СПользователями = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.РабочиеМеста.Количество() = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РабочиеМеста.Ссылка,
		|	ВЫБОР
		|		КОГДА РабочиеМеста.СтруктурнаяЕдиница.ДатаЗапускаНовойСистемыУчета <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Выгружать
		|ИЗ
		|	Справочник.РабочиеМеста КАК РабочиеМеста
		|ГДЕ
		|	(РабочиеМеста.СтруктурнаяЕдиница.ТипРозничнойТочки = ЗНАЧЕНИЕ(Перечисление.ТипыРозничныхТочек.Магазин)
		|			ИЛИ РабочиеМеста.СтруктурнаяЕдиница.ТипРозничнойТочки = ЗНАЧЕНИЕ(Перечисление.ТипыРозничныхТочек.Микромаркет) //+++АК mika 2018.05.30 ИП-00018792
		//+++АК BELN 2018.12.06 ИП-00020532.01 
		|			ИЛИ РабочиеМеста.СтруктурнаяЕдиница.ТипРозничнойТочки = ЗНАЧЕНИЕ(Перечисление.ТипыРозничныхТочек.ПространствоВкуса)) 
		//---АК BELN
		|			И РабочиеМеста.СтруктурнаяЕдиница.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РабочиеМеста.СтруктурнаяЕдиница.НомерТочки,
		|	РабочиеМеста.НомерРабочегоМеста";
					   
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаДоб = Объект.РабочиеМеста.Добавить();
			СтрокаДоб.Выгружать 	= Выборка.Выгружать;
			СтрокаДоб.РабочееМесто 	= Выборка.Ссылка;
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПоСтаройСхеме(Команда)
	
	ВыгрузитьСервер_СтараяСхема();
	
КонецПроцедуры
